Revit 2027 API
StructuralSectionAnalysisParams.TorsionalModulus Property
 Section modulus for calculations of torsion stresses (Ct)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TorsionalModulus { get; set; }
Public Property TorsionalModulus As Double
	Get
	Set
public:
property double TorsionalModulus {
	double get ();
	void set (double value);
}
member TorsionalModulus : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace